{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Привет",
                "Здравствуйте",
                "Есть кто-нибудь?",
                "Хай",
                "Добрый день"
            ],
            "responses": [
                "Привет! Как могу помочь?",
                "Здравствуйте, рад вас видеть!",
                "Привет, чем могу помочь?",
                "Привет, как дела?"
            ]
        },
        {
            "tag": "howareyou",
            "patterns": [
                "Привет, как дела?",
                "Как самочувствие?",
                "Как дела?",
                "Как жизнь?",
                "Как сам?",
                "Как у тебя дела?"
            ],
            "responses": [
                "Все отлично! Чем могу помочь?",
                "Прекрасно себя чувствую, спасибо что поинтересовались.",
                "У меня все хорошо, а как вы себя чувствуете?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Пока",
                "До свидания",
                "Увидимся позже"
            ],
            "responses": [
                "До свидания! Приходите еще!",
                "Всего хорошего!",
                "Пока! Жду вас снова."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Спасибо",
                "Большое спасибо",
                "Это полезно",
                "Спасибо большое!"
            ],
            "responses": [
                "Рад был помочь!",
                "Всегда пожалуйста!",
                "Обращайтесь еще!"
            ]
        },
        {
            "tag": "genre_interest",
            "patterns": [
                "Я люблю читать фантастику",
                "Мне нравится фэнтези",
                "Я увлекаюсь детективами",
                "Я предпочитаю романтику",
                "Мне нравится триллер",
                "Я читаю научную литературу",
                "Я люблю исторические романы",
                "Мне нравятся приключения",
                "Я увлекаюсь хоррором",
                "Я люблю комиксы",
                "Мне нравится поэзия",
                "Я читаю биографии",
                "Мне нравятся мемуары",
                "Я увлекаюсь научной фантастикой",
                "Мне нравится современная проза",
                "Я люблю классическую литературу",
                "Мне нравятся антиутопии",
                "Я читаю магический реализм",
                "Мне нравится юмор",
                "Я увлекаюсь эссеистикой",
                "Я люблю графические новеллы",
                "Мне нравятся детские книги"
            ],
            "responses": [
                "Круто! Каждый жанр по-своему уникален!",
                "Здорово! Это действительно увлекательные жанры!",
                "Отличный выбор! Каждый жанр умеет захватывать по-своему!"
            ]
        },
        {
            "tag": "sport_interest",
            "patterns": [
                "Я люблю футбол",
                "Мне нравится баскетбол",
                "Я увлекаюсь теннисом",
                "Я предпочитаю плавание",
                "Мне нравится бег",
                "Я занимаюсь волейболом",
                "Я люблю йогу",
                "Мне нравятся боевые искусства",
                "Я увлекаюсь велоспортом",
                "Я предпочитаю хоккей",
                "Мне нравится гольф",
                "Я занимаюсь фитнесом",
                "Я люблю скейтбординг",
                "Мне нравятся зимние виды спорта",
                "Я увлекаюсь серфингом",
                "Я предпочитаю спортивные танцы",
                "Мне нравится каратэ",
                "Я занимаюсь альпинизмом",
                "Я люблю рыбалку",
                "Мне нравятся экстремальные виды спорта",
                "Я увлекаюсь автоспортом"
            ],
            "responses": [
                "Круто! Спорт — это отличный способ поддерживать форму!",
                "Здорово! Каждый вид спорта приносит свои уникальные эмоции!",
                "Отличный выбор!",
                "Здорово!",
                "Это замечательно!"
            ]
        },
        {
            "tag": "user_reading",
            "patterns": ["Я люблю читать", "Я читаю книги", "Мне нравится читать"],
            "responses": ["Это здорово! Какие книги ты читаешь?", "Какой жанр тебе нравится?"]
        },
        {
            "tag": "user_sports",
            "patterns": ["Мне нравится спорт", "Я занимаюсь спортом", "Я люблю заниматься спортом"],
            "responses": ["Спорт — это отлично! Какой вид спорта тебе нравится?", "Как часто ты занимаешься спортом?"]
        },
        {
            "tag": "user_drawing",
            "patterns": ["Я увлекаюсь рисованием", "Мне нравится рисовать", "Я художник"],
            "responses": ["Здорово! Что ты любишь рисовать?", "Какой стиль рисования тебе ближе?"]
        },
        {
            "tag": "user_music",
            "patterns": ["Я люблю музыку", "Мне нравится слушать музыку", "Я играю на инструменте"],
            "responses": ["Какая музыка тебе нравится?", "На каком инструменте ты играешь?"]
        },
        {
            "tag": "user_cooking",
            "patterns": ["Мне нравится готовить", "Я увлекаюсь кулинарией", "Я люблю готовить"],
            "responses": ["Отлично! Какое твое любимое блюдо?", "Какой тип кухни тебе нравится?"]
        },
        {
            "tag": "user_traveling",
            "patterns": ["Я люблю путешествовать", "Мне нравится путешествовать", "Я увлекаюсь путешествиями"],
            "responses": ["Куда ты мечтаешь поехать?", "Какое твое любимое место для путешествий?"]
        },
        {
            "tag": "user_gaming",
            "patterns": ["Я люблю играть в игры", "Мне нравятся видеоигры", "Я увлекаюсь играми"],
            "responses": ["Какие игры тебе нравятся?", "Во что ты играешь сейчас?"]
        },
        {
            "tag": "user_photography",
            "patterns": ["Я увлекаюсь фотографией", "Мне нравится фотографировать", "Я люблю делать фотографии"],
            "responses": ["Замечательно! Какой тип фотографии тебе нравится?", "Какой твой любимый объект для съемки?"]
        },
        {
            "tag": "user_gardening",
            "patterns": ["Мне нравится садоводство", "Я увлекаюсь садом", "Я люблю ухаживать за растениями"],
            "responses": ["Это здорово! Какие растения ты выращиваешь?", "Какой у тебя сад?"]
        },
        {
            "tag": "bot_hobbies",
            "patterns": ["Какие у тебя хобби?", "Чем ты увлекаешься?", "Что ты любишь делать в свободное время?"],
            "responses": [
                "Я люблю общаться и помогать людям! А что насчет тебя?",
                "Мне нравится изучать новые вещи и делиться знаниями! А какие у тебя хобби?",
                "Я увлекаюсь искусственным интеллектом и технологиями! А чем занимаешься ты?"
            ]
        },
        {
            "tag": "interestingfacts",
            "patterns": [
                "Расскажи интересный факт",
                "Интересный факт",
                "Поделись фактом",
                "Какой интересный факт ты знаешь?"
            ],
            "responses": [
                "Знаете ли вы, что медузы могут жить без мозга?",
                "Интересно, что бананы — это ягоды, а клубника — нет.",
                "Факты говорят, что осьминоги имеют три сердца.",
                "На Венере день длиннее года — она вращается вокруг своей оси медленнее, чем обходит Солнце.",
                "Человеческий мозг на 75% состоит из воды.",
                "Куры могут распознавать более 100 различных лиц.",
                "Самая большая живущая структура на Земле — это коралловый риф Гранд-Барьер, который видно из космоса.",
                "Самая крупная жемчужина в мире достигает 6 килограммов в весе.",
                "Законодательство США допускало отправку детей по почте до 1913 года.",
                "В языке древних греков не существовало слова, которое обозначало религию.",
                "В современной истории есть промежуток времени, когда на счетах компании «Apple» было больше средств, чем у американского правительства.",
                "Среднее облако весит порядка 500 тонн, столько же весят 80 слонов.",
                "В Ирландии никогда не было кротов.",
                "Флот США содержит больше авианосцев, чем все флоты мира вместе взятые.",
                "Скорость распространения лавы после извержения близка к скорости бега гончей.",
                "Изначально отвертка была изобретена для выковыривания гвоздей, шуруп был изобретен на 100 лет позже.",
                "Библия – книга, которую чаще всего воруют в американских магазинах.",
                "Примерно 1/3 всей соли, производимой в США, расходуется на очистку дорог ото льда.",
                "Существует пробирка, диаметр которой в 10000 раз меньше диаметра человеческого волоса.",
                "Саудовская Аравия не содержит рек.",
                "В Антарктиде существует единственная река – Оникс, она течет всего 60 дней в году.",
                "У медуз нет мозгов и кровеносных сосудов.",
                "Ежедневно 60 человек становятся миллионерами.",
                "До 17 века термометры заполняли коньяком.",
                "Кошки спят больше половины своей жизни.",
                "Лимон содержит больше сахара, чем клубника.",
                "Самый долгий полёт курицы продолжался 13 секунд.",
                "Ладожское озеро является самым большим в Европе.",
                "За год на Землю падает до 500 кг марсианского метеорита.",
                "Земля делает полный оборот вокруг своей оси за 23 часа 56 минут и 4 секунды.",
                "На Юпитере регулярно идут алмазные дожди.",
                "Во вселенной больше звёзд, чем песчинок на всех пляжах Земли.",
                "В мире всего 7% левшей.",
                "Правое лёгкое человека вмещает больше воздуха, чем левое.",
                "Самая трудно излечимая фобия – боязнь страха.",
                "Алмазы могут гореть.",
                "Корова может подняться по лестнице, но не может спуститься.",
                "Утки способны нырять на глубину до 6 метров.",
                "Китайский язык является самым популярным в мире.",
                "У жирафа и человека одинаковое количество шейных позвонков.",
                "Самое высокое здание в Европе находится в Москве.",
                "Страусы развивают скорость до 70 км в час.",
                "Ежегодно интернет-трафик растёт на 314000%.",
                "Три самых дорогих бренда на Земле в эпоху до интернета: Мальборо, Кока-Кола и Будвайзер.",
                "Если капнуть на скорпиона алкоголем, он тут же сойдёт с ума и ужалит себя до смерти.",
                "Каждый восьмой американец когда-либо работал в Макдоналдсе.",
                "70% всех проданных в мире лодок используются для рыболовства.",
                "300 лет назад средняя продолжительность жизни египтянина составляла 30 лет.",
                "Во сне вы сжигаете больше калорий, чем при просмотре телевизора.",
                "В 1778 году в Париже было модно носить на женской шляпке громоотвод.",
                "Сельдерей содержит отрицательное количество калорий: на то, чтобы его съесть, нужно больше калорий, чем в нём содержится.",
                "В 18-м веке английские игорные дома держали сотрудников, чьей единственной задачей было проглотить игральные кости в случае полицейской облавы.",
                "Первым продуктом, имевшим штрих-код, стала жвачка Wrigley.",
                "В городе Калама, что в чилийской пустыне Атакама, никогда не было дождя.",
                "Российская казна на 10% пополняется из средств от продажи водки.",
                "6 месяцев жизни человек проводит, стоя перед красным сигналом светофора.",
                "Первой бомбой, сброшенной союзниками на Берлин во Второй Мировой, убило слона в зоопарке.",
                "Миг – единица времени длительностью в одну сотую секунды.",
                "Слово «самба» означает «тереться пупками».",
                "Если нажать крокодилу на глаза, он немедленно разожмёт пасть.",
                "Гудки большинства американских машин звучат в тональности фа-мажор.",
                "Термитов в мире в десять раз больше, чем людей.",
                "По весу гамбургер стоит дороже нового автомобиля.",
                "Кетчуп вытекает из бутылки со скоростью 30 километров в год.",
                "Диаметр звезды Бетельгейзе больше диаметра орбиты Земли вокруг Солнца.",
                "Объём Луны равен объёму воды в Тихом океане.",
                "В американском штате Нью-Гемпшир на номерных знаках чеканят лозунг «Живи свободным или умри».",
                "Номерные знаки делают местные заключённые.",
                "Кошка – единственное домашнее животное, которое не упоминается в Библии.",
                "Если бы человек прыгал, как блоха, он мог бы перепрыгнуть футбольное поле.",
                "Королева Елизавета I считала себя чистюлей и заявляла, что купается раз в три месяца, даже если не запачкалась.",
                "Рекордная длительность полёта курицы – 13 секунд.",
                "В Организации Объединенных Наций шесть официальных языков: английский, французский, арабский, китайский, русский и испанский.",
                "Сердце ежа бьется 300 раз в минуту.",
                "Если бы в кока-колу не добавляли краситель, она была бы зелёной.",
                "Первое переливание крови произошло в 1667 году. Врач Жан-Батист Дени перелил своему пациенту-юноше 250 миллилитров крови ягнёнка, после чего больной, как ни странно, поправился.",
                "Большая часть пыли в доме – отшелушившаяся кожа его обитателей.",
                "На каждом континенте есть город с названием Рим.",
                "Прославленный английский адмирал Горацио Нельсон всю жизнь страдал от морской болезни.",
                "Жуки на вкус похожи на яблоко, осы – на кедровый орешек, а черви – на жареный бекон.",
                "В 1830-х годах кетчуп продавали как лекарство.",
                "Ежедневно на планете 12 детей в роддомах отдают не тем родителям.",
                "Слизистая оболочка желудка обновляется каждые две недели.",
                "Самки льва приносят 90 процентов добычи.",
                "Деньги делаются не из бумаги, а из хлопка.",
                "Самец непарного шелкопряда может почувствовать запах самки за 1.8 километров.",
                "Принц Чарльз увлечённо коллекционирует унитазные сиденья.",
                "Цена билета в кино в Токио дороже, чем в Мехико, в 26 раз.",
                "Каждые семь минут на планете кто-то получает растяжение бицепса бедра, занимаясь гимнастикой.",
                "Более 80% компьютерных взломов связаны с простыми паролями.",
                "Дуб не производит жёлуди, пока он младше 50 лет.",
                "Противокомариные репелленты не отпугивают насекомых, а прячут от них вас.",
                "Спрей блокирует сенсорную систему комара, и комар не понимает, где вы.",
                "Сайт с наибольшим количеством посетительниц от 35 до 44 лет — Alka-Seltzer.com"
            ]
        },
        {
            "tag": "name",
            "patterns": [
                "Как тебя зовут?",
                "Какое твое имя?",
                "Как тебя называть?"
            ],
            "responses": [
                "Меня зовут НЕО и я буду рад вам помогать!",
                "Я НЕО - ваш помощник."
            ]
        },
        {
            "tag": "funny",
            "patterns": [
                "Расскажи анекдот!",
                "Что-то смешное!",
                "Знаешь анекдот?",
                "Рассмеши меня",
                "Пошути"
            ],
            "responses": [
                "Почему программисты не могут найти работу? Потому что они всегда ищут баги!",
                "Какой у вас любимый напиток? Чай! А у вас? Кофе! Почему? Потому что это 'мысли' в чашке!",
                "Почему коты не работают в офисе? Потому что не могут сидеть на одном месте!",
                "Какой самый оптимистичный фрукт? Апельсин! Потому что он всегда в 'цитрусовом' настроении!",
                "Почему-то фраза: «Профессор завалил студента на экзамене» – звучит совершенно обыденно, а вот «Студент завалил профессора после экзамена» – вызывает бурную реакцию.",
                "Заходят как-то аморал, нигилист и циник в бар. А бармен им:\n— У нас спиртное только с 18.",
                "Немой петух по утрам вибрирует",
                "- Папа, что такое \"некомпетентность\" и \"безразличие\"?\n- не знаю, сынок, не разбираюсь я в этом, да и оно мне собственно до пизды",
                "- Стой! Что ты пьешь! Это же метанол, ты что, не видишь?!\n- Нет.",
                "Армянская битва экстрасенсов\n- Перед вами 20 машин, в одной из них ваш брат...\n- Азорчик!\n- Оу\n- Он там",
                "Знаете в чем разница между пешкой и старым дедом? Пешка ходит е2-е4, а дед ходит е2-е2."
            ]
        },
        {
            "tag": "help",
            "patterns": [
                "Что ты умеешь",
                "Что вы можете сделать?",
                "Каковы ваши возможности?",
                "Какой твой функционал?"
            ],
            "responses": [
                "Я могу общаться с вами, а также выполнять некоторые команды.",
                "У меня достаточно разнообразный функционал, думаю я буду вам полезен!",
                "Я могу рассказывать анекдоты и помогать вам в работе."
            ]
        }
    ]
}